---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementIsElementTypeFilter
source: html/5af692c1-6061-96ea-f056-6967ab45a622.htm
---
# ElementIsElementTypeFilter Methods

Applies the filter to a given element.